In [ ]:
pip install ipython-sql psycopg2

In [2]:
%load_ext sql
%sql postgresql://postgres:ed4bdc3d@localhost:5432/a2

In [114]:
%%sql 
Insert into department values
('CS5','Computer Dual');

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [115]:
%%sql
Insert into valid_entry values
('CS5',2022,001);

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [5]:
%%sql
Insert into student values

('Ajak2',NULL, '2022CS1003', NULL, 7492790234, '2022CS1003@CS1.iitd.ac.in', 0, 'CS1');

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [14]:
%%sql insert into courses values
('CS1005', 'Intro to csy', NULL, 3, 'CS1')

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [18]:
%%sql insert into professor
values
('2021CS1004','', 'Ashish', '902', 7888989897,2021, 2024, 'CS1' );

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [22]:
%%sql insert into course_offers
values
('CS1005', '2022-2023', 2,'2021CS1004', 9, 0);

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [35]:
%%sql
insert into student_courses 
values 
('2022CS1003', 'CS1005', '2022-2023', 1, 0.6);

 * postgresql://postgres:***@localhost:5432/a2
(psycopg2.errors.RaiseException) invalid
CONTEXT:  PL/pgSQL function check_enrollment_constraints() line 31 at RAISE

[SQL: insert into student_courses
values
('2022CS1003', 'CS1005', '2022-2023', 1, 0.6);]
(Background on this error at: https://sqlalche.me/e/20/2j85)

In [ ]:
# Above all insertions

In [118]:
%%sql
UPDATE student
set dept_id='CS5'
where student_id ='2022CS1002'

 * postgresql://postgres:***@localhost:5432/a2
1 rows affected.

[]

In [34]:
%%sql
select * from student;

 * postgresql://postgres:***@localhost:5432/a2
3 rows affected.

[('Ajak1', None, '2022CS5001 ', None, '7462090234', '2022CS5001@CS5.iitd.ac.in', Decimal('46'), 'CS5'),
 ('Ajak0', None, '2022CS1001 ', None, '7462790234', '2022CS1001@CS1.iitd.ac.in', Decimal('58'), 'CS1'),
 ('Ajak2', None, '2022CS1003 ', None, '7492790234', '2022CS1003@CS1.iitd.ac.in', Decimal('49'), 'CS1')]

In [138]:
%%sql
update student_courses
set grade = 9.0
where course_id = 'CS1004'

 * postgresql://postgres:***@localhost:5432/a2
2 rows affected.

[]

In [53]:
%%sql
delete from department
where dept_id ='CS1'

 * postgresql://postgres:***@localhost:5432/a2
(psycopg2.errors.RaiseException) Department has students
CONTEXT:  PL/pgSQL function update_delete_department_trigger_func() line 35 at RAISE

[SQL: delete from department
where dept_id ='CS1']
(Background on this error at: https://sqlalche.me/e/20/2j85)

In [ ]:
%%sql 
drop table if exists valid_entry, student_courses, course_offers, professor, 
courses, student, department , student_dept_change CASCADE ;

In [80]:
%%sql 
delete from valid_entry;
delete from student_courses;
delete from course_offers;
delete from  professor; 
delete from courses;
delete from student;
delete from department ;
delete from student_dept_change;

 * postgresql://postgres:***@localhost:5432/a2
0 rows affected.
5 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]